<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/T1_20_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%B3%91%ED%95%A9_Expected_Question.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

고객과 잘 맞는 타입 추천 :)

basic1 데이터 중 'f4'를 기준으로 basic3 데이터 'f4'값을 기준으로 
병합하고,

병합한 데이터에서 r2결측치를 제거한다음, 앞에서 부터 20개 데이터를 선택하고 'f2'컬럼 합을 구하시오

In [ ]:
import pandas as pd

b1 = pd.read_csv('basic1.csv')
b3 = pd.read_csv('basic3.csv')

In [ ]:
b1.shape, b3.shape

((100, 8), (16, 3))

In [ ]:
b1.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [ ]:
b1.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [ ]:
b3.isnull().sum()

f4    0
r1    0
r2    4
dtype: int64

In [ ]:
df = pd.merge(left = b1, right = b3, how ='left', on = 'f4')

In [ ]:
df.shape

(100, 10)

In [ ]:
df.head(10)

     id   age city     f1  f2   f3    f4         f5    r1    r2
0  id01   2.0   서울    NaN   0  NaN  ENFJ  91.297791  INFP  ISFP
1  id02   9.0   서울   70.0   1  NaN  ENFJ  60.339826  INFP  ISFP
2  id03  27.0   서울   61.0   1  NaN  ISTJ  17.252986  ESFP   NaN
3  id04  75.0   서울    NaN   2  NaN  INFP  52.667078  ENFJ  ENTJ
4  id05  24.0   서울   85.0   2  NaN  ISFJ  29.269869  ESFP  ESTP
5  id06  22.0   서울   57.0   0  vip  INTP  20.129444  ENTJ  ESTJ
6  id07  36.3   서울   60.0   1  NaN  ISFJ   9.796378  ESFP  ESTP
7  id08  38.0   서울  101.0   1  NaN  INFJ  83.685380  ENFP  ENTP
8  id09   3.3   서울   35.0   2  NaN  ESFJ  17.252986  ISFP  ISTP
9  id10  95.0   서울   74.0   1  NaN  ISFP  98.429899  ENFJ  ESFJ

In [ ]:
df

      id   age city    f1  f2   f3    f4         f5    r1    r2
0   id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  INFP  ISFP
1   id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  INFP  ISFP
2   id33  47.0   부산  94.0   0  NaN  ENFJ  17.252986  INFP  ISFP
3   id41  81.0   대구  55.0   0  NaN  ENFJ  37.113739  INFP  ISFP
4   id45  97.0   대구  88.0   0  NaN  ENFJ  13.049921  INFP  ISFP
..   ...   ...  ...   ...  ..  ...   ...        ...   ...   ...
95  id56  59.0   대구   NaN   1  vip  ESTJ  73.586397  INTP  ISFP
96  id69  75.0   경기  85.0   0  NaN  ESTJ  69.730313  INTP  ISFP
97  id72   8.0   경기  97.0   0  NaN  ESTJ  97.381034  INTP  ISFP
98  id88  89.0   경기  75.0   0  NaN  ESTJ  60.339826  INTP  ISFP
99  id94  84.0   경기   NaN   1  NaN  ESTJ  90.496999  INTP  ISFP

[100 rows x 10 columns]

In [ ]:
df.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
r1       0
r2      17
dtype: int64

In [ ]:
# r2컬럼 결측치 제거
print(df.shape)
df.dropna(subset = ['r2'], inplace = True)
print(df.shape)

(100, 10)
(83, 10)

In [ ]:
df.head(20)['f2'].sum()

15

In [ ]:
df.iloc[:20]['f2'].sum()

15